{"modelTopology": {"keras_version": "2.1.6-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, null, null, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 32, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_1", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 32, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "dtype": "float32", "name": "max_pooling2d"}, "name": "max_pooling2d"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_2", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 64, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_3", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 64, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "dtype": "float32", "name": "max_pooling2d_1"}, "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_4", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 128, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_5", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 128, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_5"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "dtype": "float32", "name": "max_pooling2d_2"}, "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_6", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 256, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_7", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 256, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_7"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "dtype": "float32", "name": "max_pooling2d_3"}, "name": "max_pooling2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_8", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 512, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_8"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_9", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 512, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_9"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"use_bias": true, "activation": "linear", "data_format": "channels_last", "kernel_size": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [2, 2], "dtype": "float32", "name": "conv2d_transpose", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 256, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_transpose"}, {"class_name": "Concatenate", "inbound_nodes": [[["conv2d_transpose", 0, 0, {}], ["conv2d_7", 0, 0, {}]]], "config": {"dtype": "float32", "axis": 3, "trainable": true, "name": "concatenate"}, "name": "concatenate"}, {"class_name": "Conv2D", "inbound_nodes": [[["concatenate", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_10", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 256, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_10"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_11", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 256, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_11"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"use_bias": true, "activation": "linear", "data_format": "channels_last", "kernel_size": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [2, 2], "dtype": "float32", "name": "conv2d_transpose_1", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 128, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_transpose_1"}, {"class_name": "Concatenate", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}], ["conv2d_5", 0, 0, {}]]], "config": {"dtype": "float32", "axis": 3, "trainable": true, "name": "concatenate_1"}, "name": "concatenate_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_12", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 128, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_12"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_13", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 128, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_13"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"use_bias": true, "activation": "linear", "data_format": "channels_last", "kernel_size": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [2, 2], "dtype": "float32", "name": "conv2d_transpose_2", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 64, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_transpose_2"}, {"class_name": "Concatenate", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}], ["conv2d_3", 0, 0, {}]]], "config": {"dtype": "float32", "axis": 3, "trainable": true, "name": "concatenate_2"}, "name": "concatenate_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_14", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 64, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_14"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_15", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 64, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_15"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"use_bias": true, "activation": "linear", "data_format": "channels_last", "kernel_size": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [2, 2], "dtype": "float32", "name": "conv2d_transpose_3", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 32, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_transpose_3"}, {"class_name": "Concatenate", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}], ["conv2d_1", 0, 0, {}]]], "config": {"dtype": "float32", "axis": 3, "trainable": true, "name": "concatenate_3"}, "name": "concatenate_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_16", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 32, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_16"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_17", "bias_constraint": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 32, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_17"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"use_bias": true, "activation": "sigmoid", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "dtype": "float32", "name": "conv2d_18", "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "filters": 1, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "name": "conv2d_18"}], "input_layers": [["input_1", 0, 0]], "name": "model", "output_layers": [["conv2d_18", 0, 0]]}}, "training_config": {"metrics": ["dice_coef"], "optimizer_config": {"class_name": "Adam", "config": {"lr": 9.999999974752427e-07, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false, "beta_1": 0.8999999761581421}}, "loss_weights": null, "loss": "dice_coef_loss", "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of8", "group1-shard2of8", "group1-shard3of8", "group1-shard4of8", "group1-shard5of8", "group1-shard6of8", "group1-shard7of8", "group1-shard8of8"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_10/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "conv2d_10/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_11/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_11/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_12/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_12/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_13/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_13/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_14/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_14/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_15/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_15/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_16/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "conv2d_16/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_17/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_17/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_18/kernel", "shape": [1, 1, 32, 1], "dtype": "float32"}, {"name": "conv2d_18/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_9/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_9/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose/kernel", "shape": [2, 2, 256, 512], "dtype": "float32"}, {"name": "conv2d_transpose/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_1/kernel", "shape": [2, 2, 128, 256], "dtype": "float32"}, {"name": "conv2d_transpose_1/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_2/kernel", "shape": [2, 2, 64, 128], "dtype": "float32"}, {"name": "conv2d_transpose_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_3/kernel", "shape": [2, 2, 32, 64], "dtype": "float32"}, {"name": "conv2d_transpose_3/bias", "shape": [32], "dtype": "float32"}]}]}