{"modelTopology": {"keras_version": "2.1.6-tf", "backend": "tensorflow", "model_config": {"config": {"name": "model", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, null, null, 1], "sparse": false, "dtype": "float32", "name": "input_1"}}, {"name": "conv2d", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"filters": 32, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"filters": 32, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "max_pooling2d", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d", "dtype": "float32", "padding": "valid"}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "config": {"filters": 64, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"filters": 64, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "dtype": "float32", "padding": "valid"}}, {"name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"filters": 128, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"filters": 128, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "dtype": "float32", "padding": "valid"}}, {"name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"filters": 256, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"filters": 256, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_3", "dtype": "float32", "padding": "valid"}}, {"name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"filters": 512, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"filters": 512, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_9", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "conv2d_transpose", "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"filters": 256, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "kernel_size": [2, 2], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_transpose", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "concatenate", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_transpose", 0, 0, {}], ["conv2d_7", 0, 0, {}]]], "config": {"axis": 3, "dtype": "float32", "name": "concatenate", "trainable": true}}, {"name": "conv2d_10", "class_name": "Conv2D", "inbound_nodes": [[["concatenate", 0, 0, {}]]], "config": {"filters": 256, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_10", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "conv2d_11", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"filters": 256, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_11", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"filters": 128, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "kernel_size": [2, 2], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_transpose_1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}], ["conv2d_5", 0, 0, {}]]], "config": {"axis": 3, "dtype": "float32", "name": "concatenate_1", "trainable": true}}, {"name": "conv2d_12", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"filters": 128, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_12", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "conv2d_13", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"filters": 128, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_13", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "conv2d_transpose_2", "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"filters": 64, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "kernel_size": [2, 2], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_transpose_2", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "concatenate_2", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}], ["conv2d_3", 0, 0, {}]]], "config": {"axis": 3, "dtype": "float32", "name": "concatenate_2", "trainable": true}}, {"name": "conv2d_14", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"filters": 64, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_14", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "conv2d_15", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"filters": 64, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_15", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "conv2d_transpose_3", "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"filters": 32, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "kernel_size": [2, 2], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_transpose_3", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "concatenate_3", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}], ["conv2d_1", 0, 0, {}]]], "config": {"axis": 3, "dtype": "float32", "name": "concatenate_3", "trainable": true}}, {"name": "conv2d_16", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"filters": 32, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_16", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "conv2d_17", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"filters": 32, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "relu", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_17", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "conv2d_18", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"filters": 1, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "sigmoid", "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_18", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_18", 0, 0]]}, "class_name": "Model"}, "training_config": {"metrics": ["dice_coef"], "optimizer_config": {"config": {"amsgrad": false, "beta_2": 0.9990000128746033, "decay": 0.0, "beta_1": 0.8999999761581421, "lr": 9.999999974752427e-07, "epsilon": 1e-07}, "class_name": "Adam"}, "loss": "dice_coef_loss", "loss_weights": null, "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of8", "group1-shard2of8", "group1-shard3of8", "group1-shard4of8", "group1-shard5of8", "group1-shard6of8", "group1-shard7of8", "group1-shard8of8"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_10/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "conv2d_10/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_11/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_11/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_12/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_12/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_13/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_13/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_14/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_14/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_15/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_15/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_16/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "conv2d_16/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_17/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_17/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_18/kernel", "shape": [1, 1, 32, 1], "dtype": "float32"}, {"name": "conv2d_18/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_9/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_9/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose/kernel", "shape": [2, 2, 256, 512], "dtype": "float32"}, {"name": "conv2d_transpose/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_1/kernel", "shape": [2, 2, 128, 256], "dtype": "float32"}, {"name": "conv2d_transpose_1/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_2/kernel", "shape": [2, 2, 64, 128], "dtype": "float32"}, {"name": "conv2d_transpose_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_3/kernel", "shape": [2, 2, 32, 64], "dtype": "float32"}, {"name": "conv2d_transpose_3/bias", "shape": [32], "dtype": "float32"}]}]}